zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/coord/main.c
                    wpan_mlme_set_req(macRxOnWhenIdle, NO_PIB_INDEX, &rx_on_when_idle);
                }
                break;

            case macRxOnWhenIdle:
                {
					
					/* Set the beacon payload length. */
					uint8_t beacon_payload_len = BEACON_PAYLOAD_LEN;
				#ifdef MAC_SECURITY_ZIP
					wpan_mlme_set_req(macBeaconPayloadLength,NO_PIB_INDEX, &beacon_payload_len);
				#else
					wpan_mlme_set_req(macBeaconPayloadLength, &beacon_payload_len);
				#endif
                }
                break;

            case macBeaconPayloadLength:
				{
					/*
					 * Once the length of the beacon payload has been defined,
					 * set the actual beacon payload.
					 */
			#ifdef MAC_SECURITY_ZIP
					wpan_mlme_set_req(macBeaconPayload,NO_PIB_INDEX, &beacon_payload);
			#else
					wpan_mlme_set_req(macBeaconPayload, &beacon_payload);
			#endif				
				
				}
				break;
			case macBeaconPayload:
				{
					if (COORD_STARTING == coord_state) 
					{
					/*
					 * Initiate an active scan over all channels to
					 *determine
					 * which channel to use.
					 * Use: bool wpan_mlme_scan_req(uint8_t ScanType,
					 *                              uint32_t ScanChannels,
					 *                              uint8_t ScanDuration,
					 *                              uint8_t ChannelPage);
					 *
					 * This request leads to a scan confirm message ->
					 *usr_mlme_scan_conf
					 * Scan for about 50 ms on each channel -> ScanDuration
					 *= 1
					 * Scan for about 1/2 second on each channel ->
					 *ScanDuration = 5
					 * Scan for about 1 second on each channel ->
					 *ScanDuration = 6
					 */
					wpan_mlme_scan_req(MLME_SCAN_TYPE_ACTIVE,
							SCAN_CHANNEL,
							SCAN_DURATION_COORDINATOR,
							current_channel_page);
					}
				}	
				break;
				
			case macDefaultKeySource:
                {
                    uint8_t mac_sec_level_table_entries = 1;

                    wpan_mlme_set_req(macSecurityLevelTableEntries,
                                      NO_PIB_INDEX,
                                      &mac_sec_level_table_entries);
                }
                break;

            case macSecurityLevelTableEntries:
                {
                    uint8_t mac_sec_level_table[4] = {FRAME_TYPE_DATA,      // FrameType: Data
                                                      CMD_FRAME_ID_NA,      // CommandFrameIdentifier: N/A
                                                     // ZIP_SEC_MIN,          // SecurityMinimum: 5
													0X05,
                                                      DEV_OVERRIDE_SEC_MIN  // DeviceOverrideSecurityMinimum: True
                                                     };

                    wpan_mlme_set_req(macSecurityLevelTable,
                                      0,    // Index: 0
                                      &mac_sec_level_table);
                }
                break;

            case macSecurityLevelTable:
                {
                    uint8_t mac_key_table_entries = 1;

                    wpan_mlme_set_req(macKeyTableEntries,
                                      NO_PIB_INDEX,
                                      &mac_key_table_entries);
                }
                break;

            case macKeyTableEntries:
                {
                    uint8_t mac_key_table[34] = {
                                                  // KeyIdLookupList[1].LookupData : macDefaultKeySource || g_Sec_KeyIndex_1
                                                 default_key_source[0], // LookupData[0]
                                                 default_key_source[1], // LookupData[1]
                                                 default_key_source[2], // LookupData[2]
                                                 default_key_source[3], // LookupData[3]
                                                 default_key_source[4], // LookupData[4]
                                                 default_key_source[5], // LookupData[5]
                                                 default_key_source[6], // LookupData[6]
                                                 default_key_source[7], // LookupData[7]
                                                 KEY_INDEX_1,           // LookupData[8]
                                                 LOOKUP_DATA_SIZE_1, // LookupDataSize: 0x01 : Size 9 octets
									
                                                 1,              // KeyIdLookupListEntries = 1
                                                 // KeyDeviceList[1]
                                                 0,              // DeviceDescriptorHandle
                                                 0,              // UniqueDevice - Key is unique per node
                                                 0,              // Blacklisted
                                                 1,              // KeyDeviceListEntries
                                                 //  KeyUsageList
                                                 FRAME_TYPE_DATA,    // FrameType - Data frames
                                                 CMD_FRAME_ID_NA,    // CommandFrameIdentifier not used in ZIP
                                                 1,                  // KeyUsageListEntries
                                                 // Key
                                                 default_key[0],
                                                 default_key[1],
                                                 default_key[2],
                                                 default_key[3],
                                                 default_key[4],
                                                 default_key[5],
                                                 default_key[6],
                                                 default_key[7],
                                                 default_key[8],
                                                 default_key[9],
                                                 default_key[10],
                                                 default_key[11],
                                                 default_key[12],
                                                 default_key[13],
                                                 default_key[14],
                                                 default_key[15],
                                                };

