zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/coord/main.c
/*
 * @brief Callback function for initiation of indirect data transmission
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be used
 *                  to indicated LED to be switched off)
 */
#ifdef SIO_HUB
const char Display_Queue_Device_Data[] = "Queue data for device %u ";
const char Display_MSDU_Handle[] = "(MSDU handle:  %u)\r\n";
#endif
static void indirect_data_cb(void *parameter)
{
	uint8_t cur_device;
	uint8_t src_addr_mode;
	wpan_addr_spec_t dst_addr;
	uint8_t payload;
#ifdef SIO_HUB
	/*char sio_array[255];*/
#endif

	/* Loop over all associated devices. */
	for (cur_device = 0; cur_device < no_of_assoc_devices; cur_device++) {
#ifdef SIO_HUB
		/*sprintf(sio_array, "Queue data for device %" PRIu8 " ",
				cur_device + 1);
		printf(sio_array);*/
		printf(Display_Queue_Device_Data, (cur_device + 1));
#endif

		/*
		 * Request transmission of indirect data to device.
		 * This will just queue this frame into the indirect data queue.
		 * Once this particular device polls for pending data,
		 * the frame will be delivered to the device.
		 */
		src_addr_mode = WPAN_ADDRMODE_SHORT;
		dst_addr.AddrMode = WPAN_ADDRMODE_SHORT;
		dst_addr.PANId = DEFAULT_PAN_ID;
		dst_addr.Addr.short_address
			= device_list[cur_device].short_addr;

		payload = (uint8_t)rand(); /* Any dummy data */
		curr_msdu_handle++; /* Increment handle */

#ifdef SIO_HUB
		/*sprintf(sio_array, "(MSDU handle:  %" PRIu8 ")\r\n",
				curr_msdu_handle);
		printf(sio_array);*/
		printf(Display_MSDU_Handle, curr_msdu_handle);
#endif

 	 	if (!wpan_mcps_data_req(src_addr_mode,
				&dst_addr,
				1,  /* One octet */
 	 		 
				&payload,
				curr_msdu_handle,
				WPAN_TXOPT_INDIRECT_ACK,ZIP_SEC_MIN,ZIP_KEY_ID_MODE,KEY_INDEX_1)
	//			WPAN_TXOPT_INDIRECT_ACK,0,0,0) //Anupama
				) {
	  		 
			/*		 
 		if (!wpan_mcps_data_req(src_addr_mode,
				&dst_addr,
				1,  // One octet */
				
				 /*
				&payload,
				curr_msdu_handle,
				WPAN_TXOPT_INDIRECT_ACK,0,0,0)
				) {*/
				 
			/*
			 * Data could not be queued into the indirect queue.
			 * Add error handling if required.
			 */ 
		}
	}

	/* Start timer to initiate indirect data transmission. */
	sw_timer_start(APP_TIMER_INDIRECT_DATA,
			((uint32_t)APP_INDIRECT_DATA_DURATION_MS * 1000),
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)indirect_data_cb,
			NULL);

	parameter = parameter; /* Keep compiler happy. */
}

/*
 * @brief Callback function for updating the beacon payload
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be used
 *                  to indicated LED to be switched off)
 */
static void bcn_payload_update_cb(void *parameter)
{
	/*
	 * Counter holding the variable portion of the beacon payload.
	 *
	 * Note: If this is changed, also the define BEACON_PAYLOAD_LEN needs
	 * to be updated accordingly.
	 * If this happens, the PIB attribute macBeaconPayloadLength needs to be
	 * adjusted again as well. Since in this application the length of the
	 * beacon payload never changes, this can be skipped.
	 */
	static uint8_t bcn_payload_cnt;

	/* The counter transmitted in the beacon payload is updated and
	 * the new beacon payload is set.
	 */
	bcn_payload_cnt++;
	bcn_payload_cnt %= 10;
	/* Create printable character. */
	beacon_payload[BEACON_PAYLOAD_LEN - 1] = bcn_payload_cnt + 0x30;
	wpan_mlme_set_req(macBeaconPayload,  0,&beacon_payload);

	/* Restart timer for updating beacon payload. */
	sw_timer_start(APP_TIMER_BCN_PAYLOAD_UPDATE,
			((uint32_t)APP_BCN_PAYLOAD_DURATION_MS * 1000),
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)bcn_payload_update_cb,
			NULL);

	parameter = parameter; /* Keep compiler happy. */
}
